In [ ]:
# When entire row repeats , not only the single value

In [1]:
import pandas as pd
data = {"name": ["a", "b", "c", "d", "a", "c"], "eng": [8, 7, 5, 8, 8, 5], "hindi": [2, 3, 4, 5, 2, 6 ]}
df = pd.DataFrame(data)

In [2]:
df

  name  eng  hindi
0    a    8      2
1    b    7      3
2    c    5      4
3    d    8      5
4    a    8      2
5    c    5      6

In [ ]:
# 0,4 row is duplicate , 2, 5 is not means if  least one column is not same then it`s not duplicate

In [4]:
df["duplicated"] = df.duplicated()

In [5]:
df

  name  eng  hindi  duplicated
0    a    8      2       False
1    b    7      3       False
2    c    5      4       False
3    d    8      5       False
4    a    8      2        True
5    c    5      6       False

In [ ]:
# it is most imp to remove duplicate content , because sometimes ML model trained only on duplicate values , this mostly happens in classification

In [11]:
df = df.drop(columns= "duplicated")

In [12]:
df

  name  eng  hindi
0    a    8      2
1    b    7      3
2    c    5      4
3    d    8      5
4    a    8      2
5    c    5      6

In [14]:
df = df.drop_duplicates()

In [15]:
df

  name  eng  hindi
0    a    8      2
1    b    7      3
2    c    5      4
3    d    8      5
5    c    5      6

In [16]:
dataset = pd.read_csv("loan.csv")

In [19]:
dataset.shape

(614, 13)

In [20]:
dataset = dataset.drop_duplicates()

In [21]:
dataset.shape

(614, 13)

In [ ]:
# menas there is no duplicate in this data